# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент,
# второй и предпоследний и т.д.
#
# Пример:
#
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

lst = [2, 3, 4, 5, 6]
lst_n = []
if len(lst) % 2 == 0:
    s = len(lst) // 2
else:
    s = len(lst) // 2 + 1

for i in range(s):
    lst_n.append(lst[i] * lst[len(lst) - i - 1])
print(lst_n)
