# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
#
# Пример:
#
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

k = int(input('Введите k: '))
lst = [0, 1]
lst2 = [1]
for i in range(1, k):
    lst.append(lst[i] + lst[i - 1])
    lst2.append(lst[i + 1] * (-1) ** i)
lst2 = lst2[::-1]
lst2.extend(lst)
print(lst2)
